test/loadtest/analysisdir.yml
config:
  target: "http://localhost:3001"
  http:
    timeout: 240
  environments:
    production:
      target: "https://causalpath.org"
      http:
        timeout: 4500
    staging:
      target: "http://35.192.108.199:3001"
      http:
        timeout: 4500
    local:
      target: "http://localhost:3001"
  phases:
    - duration: 220
      arrivalCount: 20
  processor: "./processor.js"
scenarios:
  - flow:
    - post:
        url: "/api/analysisDir"
        beforeRequest: makeAnalysisDirVars
        afterResponse: analysisResponseHandler
        json:
          inputFiles: "{{ inputFiles }}"
          room: "{{ room }}"