test/loadtest/analysiszip.yml
config:
  target: "http://localhost:3001"
  http:
    timeout: 120
  environments:
    production:
      target: "https://causalpath.org"
      http:
        timeout: 3500
    staging:
      target: "http://35.192.108.199:3001"
      http:
        timeout: 3500
    local:
      target: "http://localhost:3001"
  phases:
    - duration: 200
      arrivalCount: 20
  processor: "./processor.js"
scenarios:
  - flow:
    - post:
        url: "/api/analysisZip"
        beforeRequest: makeAnalysisZipVars
        afterResponse: analysisResponseHandler
        json:
          fileContent: "{{ fileContent }}"
          room: "{{ room }}"